Rails/cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (end_date < ('2017-02-25') or start_date > ('2017-02-27')) AND "cat_rental_requests"."status" = $3  [["id", 11], ["cat_id", 2], ["status", "APPROVED"]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-08-25 20:56:41.356404"], ["id", 11]]
---
  def deny!
    overlapping_approved_requests.each { |request| request.update_attributes(status: 'DENIED') }