SQL/Active Record/URLShortener/app/models/shortened_url.rb

  def num_recent_uniques
    subtable.select { |row| 10.minutes.ago <= row.created_at }.map(&:user_id).uniq.count
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.urlurlurl.com"], ["short_url", "k83WUP-S7mNj_lQs-j7YSQ"], ["created_at", "2019-07-06 12:19:42.215007"], ["updated_at", "2019-07-06 12:19:42.215007"], ["user_id", 5]]

  def no_spamming(id)
    ShortenedUrl.where(user_id: id).count { |row| row.created_at >= 1.minute.ago } < 5
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.urlurlurl.com"], ["short_url", "lF4_rrnHQu2yMt7aBpWH7A"], ["created_at", "2019-07-06 13:04:58.874350"], ["updated_at", "2019-07-06 13:04:58.874350"], ["user_id", 21]]
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1 LIMIT $2  [["user_id", 56], ["LIMIT", 1]]

  def self.random_code
    require 'securerandom'
    loop do
      token = SecureRandom::urlsafe_base64(16)
      return token unless ShortenedUrl.exists?(short_url: token)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "BoySAZzSYTo3tQq-hInUWQ"], ["LIMIT", 1]]

  def self.factory(user, g_long_url)
    url = ShortenedUrl.find_by(long_url: g_long_url)
    return url if url

    ShortenedUrl.create!(long_url: g_long_url, short_url: ShortenedUrl.random_code, submitter: user)
---
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."long_url" = $1 LIMIT $2  [["long_url", "drfgdfgd"], ["LIMIT", 1]]
INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "drfgdfgd"], ["short_url", "BoySAZzSYTo3tQq-hInUWQ"], ["created_at", "2019-07-06 21:18:51.697058"], ["updated_at", "2019-07-06 21:18:51.697058"], ["user_id", 56]]