SQL/Active Record/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 25], ["url_id", 19], ["created_at", "2019-07-06 13:13:56.197763"], ["updated_at", "2019-07-06 13:13:56.197763"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(visitor: user, url: ShortenedUrl.factory(user, shortened_url.long_url))