Rails/cats/app/controllers/cat_rental_requests_controller.rb

SELECT "name", "cat_rental_requests"."start_date", "cat_rental_requests"."end_date", "cat_rental_requests"."status" FROM "cat_rental_requests" join cats on cats.id = cat_id ORDER BY start_date asc
---
  def index
    @cats = CatRentalRequest.joins('join cats on cats.id = cat_id').select(:name, :start_date, :end_date, :status).order('start_date asc')

SELECT "cats"."id", "cats"."name" FROM "cats"
---
  def new
    @cats = Cat.all.select(:id, :name)

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 8], ["start_date", "2019-08-05"], ["end_date", "2019-08-21"], ["created_at", "2019-08-25 19:58:01.209482"], ["updated_at", "2019-08-25 19:58:01.209482"]]
---
  def create
    request = CatRentalRequest.new(permit_params(:cat_id, :start_date, :end_date))

    request.save ? (render json: request) : (render :new)