Rails/cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @cats = Cat.all

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]
SELECT DISTINCT cat.rental_requests.start_date AS alias_0, "cats"."id" FROM "cats" LEFT OUTER JOIN "cat_rental_requests" ON "cat_rental_requests"."cat_id" = "cats"."id" WHERE "cats"."id" = $1 ORDER BY cat.rental_requests.start_date asc LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cat = Cat.includes(:rental_requests).find_by(id: require_params(:id))

INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    some_cat = Cat.new(permit_params(:name, :birth_date, :color, :sex, :description))
    some_cat.save ? (redirect_to "/cats/#{some_cat.id}") : (render :new)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @cat = Cat.find_by(id: require_params(:id))

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "birth_date" = $2, "color" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Quicko"], ["birth_date", "2014-08-06"], ["color", "black"], ["sex", "M"], ["description", "A quick, black cat"], ["updated_at", "2019-08-25 09:49:07.226558"], ["id", 4]]
---
  def update
    options = permit_params(:name, :birth_date, :color, :sex, :description)
    some_cat = Cat.find(require_params(:id))
    if some_cat
      some_cat.update(options)